In [1]:
## Objective is to check and run parameters of Pandas read_csv method

In [2]:
"""
pandas.read_csv(filepath_or_buffer, sep=', ', delimiter=None, header='infer', 
names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, 
dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, 
skiprows=None, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, 
skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, 
date_parser=None, dayfirst=False, iterator=False, chunksize=None, compression='infer', 
thousands=None, decimal=b'.', lineterminator=None, quotechar='"', quoting=0, escapechar=None, 
comment=None, encoding=None, dialect=None, tupleize_cols=None, error_bad_lines=True, 
warn_bad_lines=True, skipfooter=0, skip_footer=0, doublequote=True, delim_whitespace=False, 
as_recarray=None, compact_ints=None, use_unsigned=None, low_memory=True, buffer_lines=None, 
memory_map=False, float_precision=None)
"""

'\npandas.read_csv(filepath_or_buffer, sep=\', \', delimiter=None, header=\'infer\', \nnames=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, \ndtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, \nskiprows=None, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, \nskip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, \ndate_parser=None, dayfirst=False, iterator=False, chunksize=None, compression=\'infer\', \nthousands=None, decimal=b\'.\', lineterminator=None, quotechar=\'"\', quoting=0, escapechar=None, \ncomment=None, encoding=None, dialect=None, tupleize_cols=None, error_bad_lines=True, \nwarn_bad_lines=True, skipfooter=0, skip_footer=0, doublequote=True, delim_whitespace=False, \nas_recarray=None, compact_ints=None, use_unsigned=None, low_memory=True, buffer_lines=None, \nmemory_map=False, float_precision=None)\n'

In [3]:
import glob
import os
import pandas as pd

In [4]:
pd.__version__

'1.0.3'

In [5]:
print(os.getcwd())

/home/lubuntu/Documents/Miscellaneous Programs/Tutorials/pandas_multiindex_tutorial-master

In [6]:
path = '/home/lubuntu/Documents/Miscellaneous Programs/seaborn-data-master'
os.chdir(path)
print(os.getcwd())

/home/lubuntu/Documents/Miscellaneous Programs/seaborn-data-master

In [7]:
#Check the data available
print(glob.glob("*.csv"))

['fmri.csv', 'brain_networks.csv', 'diamonds.csv', 'iris_blankrow.csv', 'planets.csv', 'penguins.csv', 'attention.csv', 'flights.csv', 'exercise.csv', 'tips.csv', 'titanic.csv', 'iris.csv', 'dots.csv', 'gammas.csv', 'mpg.csv', 'car_crashes.csv', 'anscombe.csv', 'geyser.csv']

In [8]:
df1 = pd.read_csv('iris.csv')
df1.head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [9]:
df2 = pd.read_csv('geyser.csv', sep=' ')
df2.head(2)

   duration  waiting   kind
0       3.6       79   long
1       1.8       54  short

In [10]:
df3 = pd.read_csv('gammas.csv', header='infer')
df3.head(2)

   timepoint  ROI  subject  BOLD signal
0        0.0  IPS        0     0.513433
1        0.0  IPS        1    -0.414368

In [11]:
df4 = pd.read_csv('mpg.csv', names=['mpg', 'horsepower'])
df4.head(2)

,,,,,,,mpg,horsepower
mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu

In [12]:
df4.index

MultiIndex([( 'mpg', 'cylinders', 'displacement', 'horsepower', 'weight', ...),
            ('18.0',         '8',        '307.0',      '130.0',   '3504', ...),
            ('15.0',         '8',        '350.0',      '165.0',   '3693', ...),
            ('18.0',         '8',        '318.0',      '150.0',   '3436', ...),
            ('16.0',         '8',        '304.0',      '150.0',   '3433', ...),
            ('17.0',         '8',        '302.0',      '140.0',   '3449', ...),
            ('15.0',         '8',        '429.0',      '198.0',   '4341', ...),
            ('14.0',         '8',        '454.0',      '220.0',   '4354', ...),
            ('14.0',         '8',        '440.0',      '215.0',   '4312', ...),
            ('14.0',         '8',        '455.0',      '225.0',   '4425', ...),
            ...
            ('26.0',         '4',        '156.0',       '92.0',   '2585', ...),
            ('22.0',         '6',        '232.0',      '112.0',   '2835', ...),
            ('32.0',         '4',        '144.0',       '96.0',   '2665', ...),
            ('36.0',         '4',        '135.0',       '84.0',   '2370', ...),
            ('27.0',         '4',        '151.0',       '90.0',   '2950', ...),
            ('27.0',         '4',        '140.0',       '86.0',   '2790', ...),
            ('44.0',         '4',         '97.0',       '52.0',   '2130', ...),
            ('32.0',         '4',        '135.0',       '84.0',   '2295', ...),
            ('28.0',         '4',        '120.0',       '79.0',   '2625', ...),
            ('31.0',         '4',        '119.0',       '82.0',   '2720', ...)],
           length=399)

In [13]:
df5 = pd.read_csv('mpg.csv', usecols=['mpg', 'horsepower'])
df5.head(2)

    mpg  horsepower
0  18.0       130.0
1  15.0       165.0

In [14]:
df6 = pd.read_csv('mpg.csv', usecols=['mpg'], squeeze=True)
df6.head(2)

0    18.0
1    15.0
Name: mpg, dtype: float64

In [15]:
df6.dtype

dtype('float64')

In [16]:
df6.head()

0    18.0
1    15.0
2    18.0
3    16.0
4    17.0
Name: mpg, dtype: float64

In [17]:
df7 = pd.read_csv('planets.csv', header = None)
df7.head(2)

                 0  1        2     3      4     5
0  Radial Velocity  1  269.300  7.10  77.40  2006
1  Radial Velocity  1  874.774  2.21  56.95  2008

In [18]:
df7 = pd.read_csv('planets.csv', header = None, prefix='P_')
df7.head(2)

               P_0  P_1      P_2   P_3    P_4   P_5
0  Radial Velocity    1  269.300  7.10  77.40  2006
1  Radial Velocity    1  874.774  2.21  56.95  2008

In [19]:
df8= pd.read_csv('dots.csv') #Can't be false, mangle_dupe_cols=False)
df8.head(2)

  align choice  time  coherence  coherence.1
0  dots     T1   -80        0.0    33.189967
1  dots     T1   -80        3.2    31.691726

In [20]:
df8= pd.read_csv('dots.csv', mangle_dupe_cols=True)
df8.head(2)

  align choice  time  coherence  coherence.1
0  dots     T1   -80        0.0    33.189967
1  dots     T1   -80        3.2    31.691726

In [21]:
%timeit df9= pd.read_csv('brain_networks.csv', engine='c')

%timeit df9= pd.read_csv('brain_networks.csv', engine='python')

68.5 ms ± 739 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)
95.1 ms ± 839 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [22]:
df10= pd.read_csv('mpg.csv')
df10.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320

In [23]:
df10.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower      float64
weight            int64
acceleration    float64
model_year        int64
origin           object
name             object
dtype: object

In [24]:
# Miles converted to KMs during the read

def convert_to_km(x):
    return float(x) * float(1.6)

df11= pd.read_csv('mpg.csv', converters={'mpg': convert_to_km})
df11.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,28.8,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,24.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320

In [25]:
df12= pd.read_csv('exercise.csv', true_values=['rest'])
df12.head(5)

   Unnamed: 0  id     diet  pulse    time  kind
0           0   1  low fat     85   1 min  rest
1           1   1  low fat     85  15 min  rest
2           2   1  low fat     88  30 min  rest
3           3   2  low fat     90   1 min  rest
4           4   2  low fat     92  15 min  rest

In [26]:
df12['kind'].unique()

array(['rest', 'walking', 'running'], dtype=object)

In [27]:
df13= pd.read_csv('exercise.csv', false_values=['running'])
df13.tail(5)

    Unnamed: 0  id    diet  pulse    time     kind
85          85  29  no fat    135  15 min  running
86          86  29  no fat    130  30 min  running
87          87  30  no fat     99   1 min  running
88          88  30  no fat    111  15 min  running
89          89  30  no fat    150  30 min  running

In [28]:
#None of the rows have NAs
df13.isna().count()

Unnamed: 0    90
id            90
diet          90
pulse         90
time          90
kind          90
dtype: int64

In [29]:
df14= pd.read_csv('iris_blankrow.csv', skip_blank_lines=False)
df14.head(10)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           NaN          NaN           NaN          NaN     NaN
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN     NaN
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [30]:
df15= pd.read_csv('iris_blankrow.csv', skip_blank_lines=True)
df15.head(10)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.7          3.2           1.3          0.2  setosa
2           4.6          3.1           1.5          0.2  setosa
3           5.0          3.6           1.4          0.2  setosa
4           5.4          3.9           1.7          0.4  setosa
5           5.0          3.4           1.5          0.2  setosa
6           4.4          2.9           1.4          0.2  setosa
7           4.9          3.1           1.5          0.1  setosa
8           5.4          3.7           1.5          0.2  setosa
9           4.8          3.4           1.6          0.2  setosa

In [31]:
df16= pd.read_csv('flights.csv', parse_dates=True)
df16.head(3)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132

In [32]:
df16.dtypes

year           int64
month         object
passengers     int64
dtype: object

In [33]:
df17= pd.read_csv('flights.csv', parse_dates=['year', 'month'])
df17.head(3)

        year     month  passengers
0 1949-01-01   January         112
1 1949-01-01  February         118
2 1949-01-01     March         132

In [34]:
df17.dtypes

year          datetime64[ns]
month                 object
passengers             int64
dtype: object

In [35]:
#notice the double bracket
df18= pd.read_csv('flights.csv', parse_dates=[['year', 'month']])
df18.head(3)

  year_month  passengers
0 1949-01-01         112
1 1949-02-01         118
2 1949-03-01         132

In [36]:
df18.dtypes

year_month    datetime64[ns]
passengers             int64
dtype: object

In [37]:
df19= pd.read_csv('flights.csv', parse_dates={'date_col': ['year', 'month']})
df19.head(3)

    date_col  passengers
0 1949-01-01         112
1 1949-02-01         118
2 1949-03-01         132

In [38]:
#infer_datetime_format=True reduces the date parse time
%timeit pd.read_csv('flights.csv')
%timeit pd.read_csv('flights.csv', parse_dates=['year', 'month'])
%timeit pd.read_csv('flights.csv', parse_dates={'date_col': ['year', 'month']})
%timeit pd.read_csv('flights.csv', parse_dates={'date_col': ['year', 'month']}, infer_datetime_format=True)

3.32 ms ± 121 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)
7.26 ms ± 65.6 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)
31 ms ± 513 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)
31.6 ms ± 280 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [39]:
df20= pd.read_csv('flights.csv', parse_dates={'date_col': ['year', 'month']}, keep_date_col =True)
df20.head(3)

    date_col  year     month  passengers
0 1949-01-01  1949   January         112
1 1949-02-01  1949  February         118
2 1949-03-01  1949     March         132

In [40]:
df20.dtypes

date_col      datetime64[ns]
year                  object
month                 object
passengers             int64
dtype: object

In [41]:
#"dayfirst" parameters gives the dates in US or European manner

In [42]:
df21= pd.read_csv('titanic_compress.csv.tar.gz', compression='infer')
df21.head(3)

,titanic_compress.csv,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3.0,male,22.0,1.0,0.0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1.0,1.0,female,38.0,1.0,0.0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1.0,3.0,female,26.0,0.0,0.0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [43]:
df22= pd.read_csv('planets.csv', header=None)
df22.head(3)

                 0  1        2     3      4     5
0  Radial Velocity  1  269.300  7.10  77.40  2006
1  Radial Velocity  1  874.774  2.21  56.95  2008
2  Radial Velocity  1  763.000  2.60  19.84  2011

In [44]:
df22[0].unique()

array(['Radial Velocity', 'Imaging', 'Eclipse Timing Variations',
       'Transit', 'Astrometry', 'Transit Timing Variations',
       'Orbital Brightness Modulation', 'Microlensing', 'Pulsar Timing',
       'Pulsation Timing Variations'], dtype=object)

In [45]:
df22[0].value_counts()

Radial Velocity                  553
Transit                          397
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          9
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: 0, dtype: int64

In [46]:
#"comment" - does not read that line. 
# a string as a comment starter. Subsequent line is not read.
df23= pd.read_csv('planets.csv', header=None, comment='T')
df23.head(3)

                 0    1        2     3      4       5
0  Radial Velocity  1.0  269.300  7.10  77.40  2006.0
1  Radial Velocity  1.0  874.774  2.21  56.95  2008.0
2  Radial Velocity  1.0  763.000  2.60  19.84  2011.0

In [47]:
df23[0].value_counts() #Transit disappears!

Radial Velocity                  553
Imaging                           38
Microlensing                      23
Eclipse                            9
Pulsar                             5
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation                          1
Name: 0, dtype: int64

In [48]:
#memory_map - Copies the data into memory, and uses the operations from there.
%timeit pd.read_csv('brain_networks.csv')
%timeit pd.read_csv('brain_networks.csv', memory_map=True)

69.9 ms ± 487 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)
69 ms ± 698 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [49]:
df24 = pd.read_csv('brain_networks.csv',  skiprows=(0,1,3), header=0, skip_blank_lines=True, na_values=None)
df24.head()

,hemi,lh,rh,lh.1,rh.1,lh.2,rh.2,lh.3,rh.3,lh.4,...,rh.26,lh.26,rh.27,lh.27,rh.28,lh.28,rh.29,lh.29,rh.30,lh.30
0,0,56.055744,92.031036,3.391576,38.659683,26.203819,-49.715569,47.461037,26.746613,-35.898861,...,0.607904,-70.270546,77.365776,-21.734550,1.028253,7.791784,68.903725,-10.520872,120.490463,-39.686432
1,1,55.547253,43.690075,-65.495987,-13.974523,-28.274963,-39.050129,-1.210660,-19.012897,19.568010,...,57.495071,-76.393219,127.261360,-13.035799,46.381824,-15.752450,31.000332,-39.607521,24.764011,-36.771008
2,2,60.997768,63.438793,-51.108582,-13.561346,-18.842947,-1.214659,-65.575806,-85.777428,19.247454,...,28.317369,9.063977,45.493263,26.033442,34.212200,1.326110,-22.580757,12.985169,-75.027451,6.434262
3,3,18.514868,12.657158,-34.576603,-32.665958,-7.420454,17.119448,-41.800869,-58.610184,32.896915,...,71.439629,65.842979,-10.697547,55.297466,4.255006,-2.420144,12.098393,-15.819172,-37.361431,-4.650954
4,4,-2.527392,-63.104668,-13.814151,-15.837989,-45.216927,3.483550,-62.613335,-49.076508,18.396759,...,95.597565,50.960453,-23.197300,43.067562,52.219875,28.232882,-11.719750,5.453649,5.169828,87.809135

In [52]:
#Using Memory_map
df25 = pd.read_csv('brain_networks.csv',  skiprows=(0,1,3), header=0, skip_blank_lines=True, na_values=None, memory_map=True)
df25.head()

,hemi,lh,rh,lh.1,rh.1,lh.2,rh.2,lh.3,rh.3,lh.4,...,rh.26,lh.26,rh.27,lh.27,rh.28,lh.28,rh.29,lh.29,rh.30,lh.30
0,0,56.055744,92.031036,3.391576,38.659683,26.203819,-49.715569,47.461037,26.746613,-35.898861,...,0.607904,-70.270546,77.365776,-21.734550,1.028253,7.791784,68.903725,-10.520872,120.490463,-39.686432
1,1,55.547253,43.690075,-65.495987,-13.974523,-28.274963,-39.050129,-1.210660,-19.012897,19.568010,...,57.495071,-76.393219,127.261360,-13.035799,46.381824,-15.752450,31.000332,-39.607521,24.764011,-36.771008
2,2,60.997768,63.438793,-51.108582,-13.561346,-18.842947,-1.214659,-65.575806,-85.777428,19.247454,...,28.317369,9.063977,45.493263,26.033442,34.212200,1.326110,-22.580757,12.985169,-75.027451,6.434262
3,3,18.514868,12.657158,-34.576603,-32.665958,-7.420454,17.119448,-41.800869,-58.610184,32.896915,...,71.439629,65.842979,-10.697547,55.297466,4.255006,-2.420144,12.098393,-15.819172,-37.361431,-4.650954
4,4,-2.527392,-63.104668,-13.814151,-15.837989,-45.216927,3.483550,-62.613335,-49.076508,18.396759,...,95.597565,50.960453,-23.197300,43.067562,52.219875,28.232882,-11.719750,5.453649,5.169828,87.809135

In [53]:
%timeit df24['total'] = df24.sum(axis=1)

%timeit df25['total'] = df25.sum(axis=1)

1.48 ms ± 35.9 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)
1.5 ms ± 58.2 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)